#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДополнительныйРеквизитПараметр() Экспорт
	Возврат "ОперационныйМенеджерКлиента_266aa9d845c0482bbfd505d6034053f6";	
КонецФункции

Функция ПолучитьПараметрыТекстаСообщения(Знач ТекстСообщения, Знач Контрагент) Экспорт 
	
	МассивПараметров = Новый Массив;
	
	Текст = ТекстСообщения;
	Позиция = СтрНайти(Текст, "[");
	Пока Позиция > 0 Цикл
		Текст = Сред(Текст, Позиция + 1);
		Позиция = СтрНайти(Текст, "]");
		Если Позиция > 0 Тогда
			НайденныйПараметр = Лев(Текст,Позиция-1);
			Если МассивПараметров.Найти(НайденныйПараметр) = Неопределено Тогда
				МассивПараметров.Добавить(НайденныйПараметр);
			КонецЕсли;
			Текст = Сред(Текст, Позиция + 1);
		КонецЕсли;
		Позиция = СтрНайти(Текст, "[");
	КонецЦикла; 
	
	СоответствиеПараметров = Новый Соответствие;	
	
	СвойстваОбъекта = УправлениеСвойствами.СвойстваОбъекта(Контрагент,Истина,Истина);
	
	Для каждого ДополнительныйРеквизит Из СвойстваОбъекта Цикл
		
		Если Не ДополнительныйРеквизит.ПометкаУдаления
			И ДополнительныйРеквизит.Виден
			И ДополнительныйРеквизит.Доступен
			И Не МассивПараметров.Найти(ДополнительныйРеквизит.Имя) = Неопределено Тогда       
			
			СоответствиеПараметров.Вставить(ДополнительныйРеквизит.Имя, 
					Строка(УправлениеСвойствами.ЗначениеСвойства(Контрагент,ДополнительныйРеквизит))); 
			
		КонецЕсли; 		
		
	КонецЦикла; 
	
	Возврат СоответствиеПараметров;
	
КонецФункции

Функция ПолучитьЗаполненныйТекстСообщения(Знач ТекстШаблона, Контрагент) Экспорт 
	
	ПараметрыТекстаСообщения = ПолучитьПараметрыТекстаСообщения(ТекстШаблона, Контрагент);
	
	Для каждого КлючИЗначение Из ПараметрыТекстаСообщения Цикл		
		ТекстШаблона = СтрЗаменить(ТекстШаблона,СтрШаблон("[%1]",КлючИЗначение.Ключ),КлючИЗначение.Значение);		
	КонецЦикла; 
	
	Возврат ТекстШаблона;	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
	
#КонецЕсли